/**
 * Created by Smirnov_DS on 20.02.2017.
 * Список прекрасных вещей которых так не хватает моему
 * причудеснейшему блокноту до состояния совершенства
 * <p>
 * Редактируемый КомбоБокс выбора шрифта и поиск по элементам внутри него
 * - воруем алгоритм из строки с поиском и переделываем под нужды -
 * <p>
 * Выбор цвета для всего текста в поле ТекстАреа -
 * попробовать это
 * -fx-text-fill: blue
 * <p>
 * Функций отменить\повторить реагирующих на изменение текста в диалоговых окнах -
 * <p>
 * И конечно же пользовательский Инструктион ЧитайМеня!!
 * Открывать по пути расположения кода, украсть из загрузки FXML разметки
 * <p>
 * При включенном переносе по словам деактивировать labelShow и скрывать label
 * помнить состояния этого параметра
 */
package ch.makery.address;
