/**
 * Created by Smirnov_DS on 13.07.2017.
 *
 * Сделано :
 * выходить на выбор дисков +
 * открывать файлы сторонним приложением +
 * переходить по пути из верхней строки +
 * иконки для файлов +
 * иконки для приложений, должны соответствовать исполняемым приложениям +
 * «ленивую» загрузку папок, искусственно добавить задержку 2 секунды при раскрытии папки,задав такой папке иконку загрузки, при этом приложение не должно «замораживаться» +
 * Если кликаешь по пустой ячейке то выделение должно сниматься+
 * сортировать файлы по имени+
 * поправить разметку+
 * при удалении запрашивать разрешение+
 * Поиск по папке+
 * в поле Адреса выводить только имя папки, а при редактировании выводить целиком путь+
 * Отладить адресную строку+
 * запуск программы с адресной строки+
 * после переименования некоректно работает +
 * открытие папок +
 * переименование +
 * создать+
 * редактируемые ячейки в listview+
 * отладить контекстное меню+
 *
 * asdgjkasdksjagd
 *
 * Осталось сделать:
 * добавление схожих функций с «Проводником Windows» на ваше усмотрение.:
 * отладить rename
 * если не получилось переименовать разрешать переименовывать
 * описать ошибки:
 *если при создании  отменить создание то после этого нельзя создать папку
 * Перелохматить приложение - ядро должно быть в MainApp
 *
 * иконки должны соответствовать состоянию папки (закрыта, раскрыта)  - не делать
 *
 * Приятный и интуитивно понятный интерфейс приложения
 * Краткий и понятный исходный код
 * Большим плюсом будет выполненное дополнительное задание+
 *
 * Сегодня : 19.07.2017 Сделать:
 *
 */
package com.denistouch.FileBrowser;