/**
 * Created by Smirnov_DS on 13.07.2017.
 *
 * Сделано :
 * выходить на выбор дисков +
 * открывать файлы сторонним приложением +
 * переходить по пути из верхней строки +
 * иконки для файлов +
 * иконки для приложений, должны соответствовать исполняемым приложениям +
 * «ленивую» загрузку папок, искусственно добавить задержку 200мсек при раскрытии папки,задав такой папке иконку загрузки, при этом приложение не должно «замораживаться» +
 * Если кликаешь по пустой ячейке то выделение должно сниматься+
 * сортировать файлы по имени+
 * поправить разметку+
 * при удалении запрашивать разрешение+
 * Поиск по папке+
 * в поле Адреса выводить только имя папки, а при редактировании выводить целиком путь+
 * Отладить адресную строку+
 * запуск программы с адресной строки+
 * после переименования некоректно работает +
 * открытие папок +
 * переименование +
 * создать+
 * редактируемые ячейки в listview+
 * отладить контекстное меню+
 * если при создании  отменить создание то после этого нельзя создать папку+
 * если не получилось переименовать, разрешать переименовывать+
 * после перехода в папку из адресной строки не меняется абсолютный путь на имя+
 * засунуть все возможные задумчивые операции в отдельный поток: удалить, копировать, вставить, перейти внутрь, перейти вверх.+
 *
 * Осталось сделать:
 * найти и описать ошибки:
 * перенести все основные функции в МэйнАпп
 *
 * Приятный и интуитивно понятный интерфейс приложения
 * Краткий и понятный исходный код
 * Большим плюсом будет выполненное дополнительное задание+
 *
 */
package com.denistouch.FileBrowser;
